package java1_lection4;

/**
 * Клас демонструє невдале рішення при проектуванні зв'язку між класами, які
 * логічно не мають зв'язку наслідування
 * 
 * @author Владислав
 * 
 */
public class ДивнаДівчина extends Волосся {

	private String name;
	private boolean brain = false;

	public ДивнаДівчина(String name) {
		this.name = name;
	}

	public static void main(String[] args) {

		ДивнаДівчина дивакувата = new ДивнаДівчина("ДаЗдраПерМа "); // Ім'я
																	// створене
																	// в честь
																	// свята
																	// "Да здравствует первое мая"
																	// :)

		// На перший погляд все круто. Наша дівчинка вміє працювати зі своїм
		// волосям.
		дивакувата.підстригти();
		дивакувата.помити();
		дивакувата.зачісати();
		дивакувата.пофарбувати();

		System.out
				.println(" - Привіт дівчино, в вас такі чарівні очі...давайте познайомимось");
		System.out.println(" - Привіт незнайомцю. Спробуй.");
		System.out
				.println(" - Я осьо знаєш студент з могилянки, на програміста вчуся.");
		System.out.println(" - Круто! Що ж можна і познайомитись - ти правий.");
		System.out.println(" - Мене звати Владислав. А яке твоє ім'я? ");
		System.out.println(" - Я " + дивакувата); // А ось це вже fail. Такого
													// хлопця відлякала...
		System.out
				.println(" - Та ну???... Знаєш в мене тут справи, я зовсім забув...іншим часом поспілкуємось...");

		// Мораль - будьте обережними з використаннями наслідування. Можуть
		// виникнути найнеочікуваніші проблеми :)
	}

}
