/**
 * В цьому класі ми починаємо готувати бутерброд
 * для цього нам потрібен хліб
 * але не просто буханка хліба,
 * а спеціально підготовлена
 */
package java1_lection3;

public class Sandwich {

	public static void main(String[] args) {
		// ми не можемо викликати захищений конструктор
		// Bread x = new Bread();

		// нам повертається екземпляр класу Bread
		// спеціально підготовлений для бутерброду - порізаний
		Bread x = Bread.prepareBread();

		// ми не можемо викликати цей метод, бо він захищений
		// x.slice();
	}

}
